In [2]:
import pandas as pd
import numpy as np

### Creating a Data Frame

In [3]:
data = [['Dinesh', 10], ['Nithya', 12], ['Raji', 13]]
df = pd.DataFrame(data, columns=['Name', 'Age'])
print(df)

     Name  Age
0  Dinesh   10
1  Nithya   12
2    Raji   13

### Custom Index Data Frame

In [6]:
data = {'Name' : ['Kavitha', 'Sudha', 'Raju', 'Vignesh'],
         'Age' : [28, 34, 29, 42]}
df = pd.DataFrame(data, index = ['r1', 'r2', 'r3', 'r4'])
print(df)

       Name  Age
r1  Kavitha   28
r2    Sudha   34
r3     Raju   29
r4  Vignesh   42

### Miscellaneous

In [4]:
df.head()

       Name  Age
r1  Kavitha   28
r2    Sudha   34
r3     Raju   29
r4  Vignesh   42

In [6]:
nums = df.index.values
print(nums)

['r1' 'r2' 'r3' 'r4']

In [7]:
nums = df.columns.values
print(nums)

['Name' 'Age']

In [8]:
df.T

           r1     r2    r3       r4
Name  Kavitha  Sudha  Raju  Vignesh
Age        28     34    29       42

In [10]:
df.sort_values(by = 'Name')

       Name  Age
r1  Kavitha   28
r3     Raju   29
r2    Sudha   34
r4  Vignesh   42

In [19]:
# Axis 0 is y axis Vertically
df = df.sort_index(axis = 0, ascending = False)
df

       Name  Age
r4  Vignesh   42
r3     Raju   29
r2    Sudha   34
r1  Kavitha   28

In [7]:
print(df[0:3]) # First 3 rows
print()
print(df['Name'][0:2]) # Specific Column

       Name  Age
r1  Kavitha   28
r2    Sudha   34
r3     Raju   29

r1    Kavitha
r2      Sudha
Name: Name, dtype: object

In [33]:
# iloc allows to access df like a matrix

print(df.iloc[0])  # Entire 1st row
print()
print(df.iloc[1,:1]) # 2nd row till 1st column(excluded)
print()
names = df['Name'].values
print(names)
print(df[['Name', 'Age']][:5])

Name    Vignesh
Age          42
Name: r4, dtype: object

Name    Raju
Name: r3, dtype: object

['Vignesh' 'Raju' 'Sudha' 'Kavitha']
       Name  Age
r4  Vignesh   42
r3     Raju   29
r2    Sudha   34
r1  Kavitha   28

In [35]:
# Filtering
df1 = df[df['Age'] >= 29]
df1

       Name  Age
r4  Vignesh   42
r3     Raju   29
r2    Sudha   34

In [8]:
# Making a New column
df['Salary'] = [1000, 2000, 3000, 4000]
df

       Name  Age  Salary
r1  Kavitha   28    1000
r2    Sudha   34    2000
r3     Raju   29    3000
r4  Vignesh   42    4000

### Deletion

In [10]:
# Delete column
df.drop('Salary', axis = 1, inplace = True)
# Delete row
df.drop('r2', axis = 0, inplace = True)
df

       Name  Age
r1  Kavitha   28
r3     Raju   29
r4  Vignesh   42

In [44]:
# df1 = 10 x 5, df2 = 10 x 3
# df_new = pd.concat(df1, df2, axis = 1)
# axis = 1 horizontally adding, 10 x 8

In [45]:
# df1 = 10 x 5, df2 = 15 x 5
# df_new = pd.concat(df1, df2, axis = 0)
# result = 25 x 5

####